[
    {
        "opinion_id": "19450487",
        "author": "a...3",
        "recommend": true,
        "stars": 5.0,
        "content_pl": "Cieżko jest powiedzieć jak bardzo s25ultra stał się moim idealnym samsungiem. Jest mniejszy, lżejszy, użyto wspaniałych materiałów, ulepszono 1 aparat, zmieniono wygląd, który teraz jest prosty i elegancki a moim zdaniem już s23ultra wyglądał na premium a teraz dodatkowo otrzymujemy telefon w którym ciężko zarysować nawet ramkę. Wspaniała praca na baterii i nareszcie po raz pierwszy od wielu lat smasung posłuchał i sprawił, że zdjęcia wysokiej rozdzielczości nie są już tak mocno przetworzone aż nie dało się na nie patrzeć. Zdjęcia osób i zwierząt w ruchu są po raz pierwszy możliwe i dlatego warto ten sprzęt kupić pomimo 2 wad. Po pierwsze martwię się o temperatury. Mamy zimową aurę a telefon podczas używania aparatu potrafi się zagrzać do 40°C nie jest to dużo, ale jabłuszkowa konkurencja pokazuje,że można mieć 5°C mniej a to już sporo i latem może to byc dokuczliwe.  S25ultra po raz pierwszy pokazał, że od perfekcji dzielił go tylko włos a mianowicie pozbawienie piórka s-pen obsługi BT to najgłupszy pomysł na świecie, samsung twierdzi, że używał go tylko 1%ludzi - dziwne bo 1% z 20.500 to jest 205 a co do czego okazało się, że na 20.500 używało rysika prawie 4000 co jest bliskie 20% - a to oznacza, że statysta firmy popełnił potężny błąd. Samsungu sprzedaj nam rysik do s25u z obsługą bt aby wywoływać nim zdjęcia!!!",
        "pros_pl": [
            "aparaty",
            "czas pracy na baterii",
            "funkcjonalność",
            "łatwość obsługi",
            "poręczny",
            "szybki",
            "szybkość ładowania",
            "wygląd"
        ],
        "cons_pl": [],
        "up_votes": 5,
        "down_votes": 7,
        "published": "2025-02-14 19:45:27",
        "purchased": "2025-01-22 19:48:39",
        "content_en": "It's hard to say how much S25ultra has become my perfect Samsung. It is smaller, lighter, great materials were used, 1 camera has been improved, the appearance has been changed, which is now simple and elegant and in my opinion S23ultra looked on premium and now we additionally get a phone in which it is hard to outline the frame. Great battery work and finally for the first time in many years Smasung listened and made high resolution photos not so processed until they could not be looked at. Photos of people and animals in motion are possible for the first time and therefore it is worth buying this equipment despite 2 disadvantages. First of all, I'm worried about temperature. We have a winter aura and the phone while using the camera can heat up to 40 ° C This is not a lot, but apple competition shows that you can have 5 ° C less and this is a lot and in summer it can be troublesome.  S25ultra first showed that only the hair was divided from perfection, namely the deprivation of the S -pen bt support is the stupidest idea in the world, Samsung claims that only 1% of people used it - strange because 1% of 20,500 is 205 and as it turned out that at 20,500 it was used by the ditch almost 4,000, which is a powerful company - and this means that the company made a powerful company mistake. Samsung, sell us a stylus for S25U with BT support to develop photos with it !!!",
        "pros_en": [
            "apparatus",
            "battery life",
            "functionality",
            "ease of use",
            "handy",
            "fast",
            "charging speed",
            "appearance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "19558739",
        "author": "f...5",
        "recommend": true,
        "stars": 5.0,
        "content_pl": "Samsung s25 spełnia w 100% moje oczekiwania, mocna konstrukcja , bezproblemowo obsługuję się jedną ręką.  dużo by wymieniać,  ale Samsung  s25 jest wart swojej ceny . Jak zawsze z resztą.  Polecam w 100%",
        "pros_pl": [
            "aparaty",
            "czas pracy na baterii",
            "funkcje ai",
            "funkcjonalność",
            "łatwość obsługi",
            "odgrzewane aparaty",
            "okrojony s-pen",
            "poręczny",
            "szybki",
            "szybkość ładowania",
            "wielki i ciężki",
            "wielozadaniowość",
            "wolne ładowanie 25w",
            "wygląd"
        ],
        "cons_pl": [],
        "up_votes": 0,
        "down_votes": 0,
        "published": "2025-03-26 22:41:23",
        "purchased": "2025-03-12 15:57:55",
        "content_en": "Samsung S25 meets 100% my expectations, a strong construction, I support with one hand without problems.  A lot to exchange, but Samsung S25 is worth the money. As always with the rest.  I recommend 100%",
        "pros_en": [
            "apparatus",
            "battery life",
            "AI functions",
            "functionality",
            "ease of use",
            "reheated cameras",
            "cut-out s-pen",
            "handy",
            "fast",
            "charging speed",
            "great and heavy",
            "multitasking",
            "Free charging 25W",
            "appearance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "19450052",
        "author": "qawsed6423",
        "recommend": true,
        "stars": 4.5,
        "content_pl": "Telefon szybki, sprawny, wszystko działa bardzo dobrze. Niektóre funkcje AI są przydatne.\nAparaty bardzo dobre, ale niestety nie aż tak dobre jak topowe smartfony kilku innych marek.\nŁadowanie 45W jest przyzwoite, ale gorzej niż w chińskich smarfonach.\nJak dla mnie trochę za duży i za ciężki, ale to już kwestia gustu.\nRysik został niestety okrojony z funkcjonalności bluetooth i jest to bardzo niefajne bo nieuzasadnione. Ale i tak żaden inny flagowiec nie ma w ogóle rysika więc nie będę się czepiał za dużo.\nOgólnie smarfon bardzo dobry, chociaż cena mogłaby być trochę niższa.",
        "pros_pl": [
            "czas pracy na baterii",
            "funkcje ai",
            "funkcjonalność",
            "łatwość obsługi",
            "szybki",
            "wygląd"
        ],
        "cons_pl": [
            "aparaty",
            "okrojony s-pen",
            "poręczny",
            "wielki i ciężki"
        ],
        "up_votes": 2,
        "down_votes": 1,
        "published": "2025-02-14 15:17:43",
        "purchased": "2025-01-25 00:02:44",
        "content_en": "The phone is fast, efficient, everything works very well. Some AI functions are useful.\nThe cameras are very good, but unfortunately not as good as the top smartphones of several other brands.\nCharging 45W is decent, but worse than in Chinese smartphones.\nFor me a bit too big and too heavy, but it's a matter of taste.\nThe stylus was unfortunately cut off from the Bluetooth functionality and it is very unfounded because it is unjustified. But still no other flagship has a stylus at all, so I will not pick on too much.\nGenerally a very good smartphone, although the price could be a little lower.",
        "pros_en": [
            "battery life",
            "AI functions",
            "functionality",
            "ease of use",
            "fast",
            "appearance"
        ],
        "cons_en": [
            "apparatus",
            "cut-out s-pen",
            "handy",
            "great and heavy"
        ]
    },
    {
        "opinion_id": "19615290",
        "author": "Robert",
        "recommend": true,
        "stars": 4.5,
        "content_pl": "Po latach użytkowania Huaweiów oraz Xiaomi przesiadka na Samsunga S25. Po miesiącu użytkowania stwierdzam że kupiłem telefon idealny. Po \"patelniach\" z prawie 7\" przekątną, 6,2\" Samsunga to idealny rozmiar. Telefon jest lekki, świetnie leży w dłoni, można długo rozmawiać ze słuchawką przy uchu. System i nakładka jest świetna, intuicyjna. Działa mega płynnie. Wyświetlacz jest jasny i ma piękne kolory. Miałem obawy do niskiej mocy ładowania - w poprzednim telefonie miałem 65W ale to nie jest żaden problem, telefon ładuje się do 90% w godzinkę. Zapewne dzięki mniejszej mocy ładowania bateria posłuży dłużej. Bardzo na plus długość pracy baterii. Przy normalnym użytkowaniu to około 1,5 -2 dni pracy na jednym ładowaniu. Telefon robi piękne zdjęcia i filmy. Mały minus za czytnik linii papilarnych, czasem trzeba mieć cierpliwość i próbować kilka razy odblokować ekran bo nie chce rozpoznać odcisku palca. Telefon dla mnie zrobił szczególne wrażenie w kolorze niebieskim i oryginalnym etui silikonowym Samsunga. Ogólnie jestem bardzo zadowolony i zostanę z nim na dłużej.",
        "pros_pl": [],
        "cons_pl": [],
        "up_votes": 2,
        "down_votes": 0,
        "published": "2025-04-24 08:25:49",
        "purchased": "2025-03-31 18:45:47",
        "content_en": "After years of using Huawei and Xiaomi, a change to Samsung S25. After a month of use, I find that I bought the perfect phone. After \"pans\" with almost 7 \"diagonal, 6.2\" Samsung is the perfect size. The phone is lightweight, it lies well in your hand, you can talk with the handset for a long time. The system and overlay are great, intuitive. It works mega smoothly. The display is bright and has beautiful colors. I was concerned about low charging power - in the previous phone I had 65W but this is not a problem, the phone charges up to 90% in an hour. Probably thanks to the lower charging power, the battery will last longer. Very plus the length of the battery. With normal use, it is about 1.5-2 days of work on one charge. The phone takes beautiful photos and videos. A small minus for a fingerprint reader, sometimes you need to have patience and try to unlock the screen several times because you do not want to recognize the fingerprint. The phone for me made a special impression in blue and the original Samsung silicone case. In general, I am very happy and I will stay with him for longer.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "19698965",
        "author": "w...0",
        "recommend": true,
        "stars": 4.0,
        "content_pl": "Telefon samsung galaxy s25+. Ważna jest dla mnie bateria i oceniam ją przeciętnie, wytrzyma spokojnie jeden dzień, na dwa dni już nie ma szans mimo ze mam ustawiony tryb lekki. Ładowanie bezprzewodowe bardzo wolne. Lekko się grzeje przy bardziej obciążających czynnościach, w tym przy robieniu zdjęć. Dość sporo tez zjada AOD mimo ze odświeżanie ekranu jest wtedy minimalne, myślę ze zużywa nawet ok 1% baterii na godzinne. Zmniejszyłem maksymalne odświeżanie na 60 Hz a nie 120 Hz bo nie widzę różnicy. Szybkość, wyświetlacz, dźwięk w porządku, funkcji AL jeszcze nie testowałem. Dość lekki i ma małe ramki wokół to na plus. Jednak myślę ze zbyt drogi w stosunku do możliwości i cen innych telefonów np. serii A.",
        "pros_pl": [],
        "cons_pl": [],
        "up_votes": 1,
        "down_votes": 0,
        "published": "2025-06-02 08:59:06",
        "purchased": "2025-05-21 12:59:58",
        "content_en": "Samsung Galaxy S25+phone. The battery is important to me and I rate it on average, it will last calmly one day, for two days there is no chance even though I have a light mode set. Wireless charging is very slow. It warms slightly with more burdensome activities, including taking photos. It also eats quite a lot, despite the refreshment of the screen is minimal then, I think it consumes up to about 1% of the battery for an hour. I reduced the maximum refreshment to 60 Hz, not 120 Hz because I don't see the difference. Speed, display, sound in order, I haven't tested the AL function yet. Quite light and has small frames around it is a plus. However, I think too expensive in relation to the possibilities and prices of other phones, e.g. series A.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "19464319",
        "author": "s...x",
        "recommend": true,
        "stars": 5.0,
        "content_pl": "Oceniam na gorąco po paru dniach użytkowania. Przesiadłem się na S25 z S20FE 5G no i różnica jest znacząca. Po pierwsze smartfon działa znacznie płynniej i szybciej. W kwestii foto też widać różnice na plus, jakość dźwięku podczas rozmów jest bardzo dobra. Galaxy AI daje mega możliwości. Zauważyłem również poprawę zasięgu- tam gdzie wcześniej bywał problem z zasięgiem tak teraz jest bezproblemowo. Co do baterii na razie trudno ocenić. No i wizualnie też bardzo mi się podoba, dobrze leży w dłoni. Nie mogę jedynie na razie przyzwyczaić się do innego położenia czytnika linii papilarnych, ale to tylko chwilowa niedogodność.",
        "pros_pl": [
            "aparaty",
            "czas pracy na baterii",
            "funkcjonalność",
            "łatwość obsługi",
            "poręczny",
            "szybki",
            "wielozadaniowość",
            "wygląd"
        ],
        "cons_pl": [],
        "up_votes": 1,
        "down_votes": 0,
        "published": "2025-02-20 18:28:08",
        "purchased": "2025-01-23 20:36:05",
        "content_en": "I rate hot after a few days of use. I switched to S25 with S20fe 5G and the difference is significant. First of all, the smartphone works much smoother and faster. In terms of photo, you can also see differences in the plus, sound quality during conversations is very good. Galaxy AI gives mega possibilities. I also noticed an improvement in reach- where there was a problem with the range so now it is so easy. As for the battery, it is difficult to assess for now. And visually I like it very much, it fits well in my hand. I can't just get used to another fingerprint reader location, but it's just a temporary inconvenience.",
        "pros_en": [
            "apparatus",
            "battery life",
            "functionality",
            "ease of use",
            "handy",
            "fast",
            "multitasking",
            "appearance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "19588891",
        "author": "j...z",
        "recommend": true,
        "stars": 5.0,
        "content_pl": "Telefon z dystrybucji europejskiej (konkretnie z Niemiec, dowiedziałem się w sklepie przy odbiorze).\nNie ma potrzeby przepłacać.\nZ zauważonych drobnych mankamentów po dwu-tygodniowym  użytkowaniu:\n- rysik S Pen jest wrażliwy magnetyczne etui. Nie działał na pewnym obszarze wyświetlacza - musialem wymontować magnes z etui i wszystko zaczęło smigać,\n- czasami są problemy z czujnikiem linii papilarnych, trzeba mocniej i dłużej przytrzymać. Może to szkło 3mk kupione razem z telefonem zakłóca - wymienię na inne i zobaczę.\n\nDokupiłem jeszcze słuchawki Samsung Buds3 Pro, smartwatcha (Galaxy Watch 2) i tablet mam (S9 FE) i zrobił się zestaw bomba.\nJeszcze do opanowania szereg funkcji AI - potencjał widzę duży.\n\nPolecam, towar warty swojej ceny.",
        "pros_pl": [],
        "cons_pl": [],
        "up_votes": 1,
        "down_votes": 1,
        "published": "2025-04-09 21:04:18",
        "purchased": "2025-03-19 23:33:57",
        "content_en": "European distribution phone (specifically from Germany, I found out in the store on delivery).\nThere is no need to overpay.\nFrom the noticed minor shortcomings after two-week use:\n- The s Pen stylus is a sensitive magnetic case. It did not work in a certain area of ​​the display - I had to remove the magnet from the case and it all started smoking\n- Sometimes there are problems with the fingerprint sensor, you need to hold more and longer. Maybe it is 3mk glass bought together with the phone disrupts - I will replace them with others and see.\n\nI still bought Samsung Buds3 Pro headphones, smartwatch (Galaxy Watch 2) and I have a tablet (S9 Fe) and a bomb set was made.\nStill to master a number of AI functions - I see a large potential.\n\nI recommend, the goods worth the price.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "19706694",
        "author": "p...1",
        "recommend": true,
        "stars": 5.0,
        "content_pl": "Telefon bardzo fajny, zostałem niejako zmuszony do jego zakupu, bo szukałem czegoś kompaktowego a wiadomo jak to dzisiaj jest z kompaktami na rynku. Spełnia swoje oczekiwania. Jedna rzecz. Aplikacja canal plus ( jeśli ktos używa) niemiłosiernie drenuje baterie a telefon się \"gotuje\". Dosłownie. Sprawa zgłoszona do canal plus, mają zrobić jakąś poprawkę w aplikacji.  Poza tym wszystkie inne serwisy vod w porządku. Nie bójcie się baterii. Telefon przy moim użytkowaniu,  a często do niego zaglądam, naprawdę spokojnie wytrzymuje od 6 rano do późnych godzinach godzin wieczornych, nawet na 5g.Tutaj mile zaskoczenie. Poprzednio niby miałem 5000 a w trakcie dnia, musiałem sięgać po ładowarkę.  Tutaj optymalizacja jest naprawdę na wysokim poziomie. Jedna rzecz mnie irytuje ( też zgłoszone i mają się tym zająć) po najnowszej aktualizacji , nie są widoczne na górnej belce powiadomień wszystkie ikony-(volte, bluetooth, nfc itd) dopiero po \"ściągnięciu \" w menu widać. Dla mnie na minus, ale może komuś, to nie będzie przeszkadzać.",
        "pros_pl": [
            "czas pracy na baterii",
            "funkcjonalność",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons_pl": [],
        "up_votes": 0,
        "down_votes": 0,
        "published": "2025-06-05 15:20:12",
        "purchased": "2025-05-17 19:08:56",
        "content_en": "The phone was very nice, I was forced to buy it, because I was looking for something compact and you know how it is with compacts on the market today. Meets its expectations. One thing. The Canal Plus application (if someone uses) mercilessly drains the batteries and the phone \"cooks\". Literally. The case reported to Canal Plus, they are to make some correction in the application.  Besides, all other VOD services are fine. Don't be afraid of the battery. The phone with my use, and I often look at it, it really stands calmly from 6 am to late hours of evening, even at 5g. Nice surprise. Previously, I had 5000 and during the day, I had to reach for a charger.  Here the optimization is really at a high level. One thing irritates me (also reported and to take care of it) after the latest update, all icons are not visible on the upper beam-(Volte, Bluetooth, NFC, etc.) only after \"downloading\" in the menu you can see. For me on a minus, but maybe someone, it will not bother.",
        "pros_en": [
            "battery life",
            "functionality",
            "ease of use",
            "appearance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "19445376",
        "author": "p...4",
        "recommend": null,
        "stars": 3.0,
        "content_pl": "Powróciłem do telefonów tej marki po 3 latach przerwy. Przekonał mnie procesor Snapdragon Elite, mały ekran i topowe podzespoły, choć wolałbym, żeby Samsung poszedł krokiem pewnej konkurencji i wrzucał do małego ekranu lepsze aparaty (wersja PRO). Ale i tak jest nieźle. Wszystko działa mega płynnie, bardzo ucieszyłem się z funkcji \"tryby\", gdzie można sobie robić różne automatyzacje w zależności od tego, co robimy albo gdzie jesteśmy.\nNo to czemu tylko 3 gwiazdki? Bo ładowanie przewodowe i bezprzewodowe z takimi mocami to nieporozumienie (mój poprzedni telefon z takim samym ekranem i większą baterią miał ładowanie 65W, a nie 25W). Ale największy minus i rozczarowanie to szumnie prezentowane AI - w praktyce okazuje się, że \"now brief\" to ekran, gdzie pokazuje mi się prognoza pogody (mało trafna bo słaby dostawca), wycinek z kalendarza i proponowana piosenka na spotify. Koniec. Liczyłem, że po wprowadzeniu adresu pracy i jeżdżeniu tam tygodnia o tych samych godzinach, telefon wyrobi rutynę i będzie mnie informował, że np. dziś jest korek i muszę wyjechać wcześniej. Inny przykład - proszę tą cudowną AI Gemini o włączenie telewizora (oczywiście marki samsung z zeszłego roku, podpięty do Smartthings) - \"nie mogę jeszcze wykonywać takiego polecenia\". Przycisk \"Nagraj połączenie\" - w pierwszym dniu działało, w kolejnym zniknęło z menu podczas rozmowy.\nTakże czuję rozczarowanie. Myślałem, że zmiana z chińczyka na koreańczyka to będzie nowa jakość. Nie jest.",
        "pros_pl": [
            "aparaty",
            "łatwość obsługi",
            "poręczny",
            "szybki",
            "wygląd"
        ],
        "cons_pl": [
            "czas pracy na baterii",
            "funkcjonalność",
            "szybkość ładowania"
        ],
        "up_votes": 5,
        "down_votes": 1,
        "published": "2025-02-13 08:53:54",
        "purchased": "2025-01-23 09:39:31",
        "content_en": "I returned to the phones of this brand after a 3 -year break. I was convinced by the Snapdragon Elite processor, a small screen and top components, although I would prefer Samsung to go a step of some competition and throw better cameras into a small screen (PRO version). But it's still good. Everything works very smoothly, I was very happy with the \"Mode\" function, where you can do various automatisations depending on what we do or where we are.\nSo why only 3 stars? Because wired and wireless charging with such powers is a misunderstanding (my previous phone with the same screen and a larger battery was charging 65W, not 25W). But the biggest minus and disappointment are noisy AI - in practice it turns out that \"Now Brief\" is a screen where I show the weather forecast (not enough because a weak supplier), a clipping of the calendar and the proposed song on Spotify. End. I was hoping that after entering the work address and going there a week at the same hours, the phone will make a routine and would inform me that, for example, there is a cork today and I have to leave earlier. Another example - I am asking this wonderful AI Gemini to turn on the TV (of course, Samsung from last year, connected to SmartThings) - \"I can't follow such a command yet\". The \"Record the connection\" button - on the first day it worked, on the next one disappeared from the menu during the conversation.\nI also feel disappointed. I thought that the change from Chinese to Korean would be a new quality. Is not.",
        "pros_en": [
            "apparatus",
            "ease of use",
            "handy",
            "fast",
            "appearance"
        ],
        "cons_en": [
            "battery life",
            "functionality",
            "charging speed"
        ]
    },
    {
        "opinion_id": "19431139",
        "author": "m...4",
        "recommend": true,
        "stars": 5.0,
        "content_pl": "Telefon lekki zgrabny, intuicyjny świetne aparaty i dłuższe działanie na jednej baterii.",
        "pros_pl": [
            "czas pracy na baterii",
            "funkcjonalność",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons_pl": [],
        "up_votes": 1,
        "down_votes": 1,
        "published": "2025-02-06 18:00:21",
        "purchased": "2025-01-23 00:08:34",
        "content_en": "The phone is a slight shapely, intuitive great camera and longer operation on one battery.",
        "pros_en": [
            "battery life",
            "functionality",
            "ease of use",
            "appearance"
        ],
        "cons_en": []
    }
]